import { useParams } from 'react-router-dom';
import banner from '../../../../assets/img/banner.png';
import { AboutIcons } from './components/about-icons';
import Example from './components/LottieAnimation';
import { useEffect, useState } from 'react';

export default function Main() {
    const { codeNum } = useParams();

    const [loader, setLoader] = useState<boolean>(true);


    useEffect(() => {
        setTimeout(() => {
            if (codeNum) {
            }
        }, 2000);
    }, [codeNum]);




    return <>
        ?
        <Example />
        :
        <>
            <section className="banner">
                <div className="banner__container container">
                    <div className="banner__text">
                        <h1 className='h1'>Сделай знания доступными с помощью платформы <span> Фенек</span ></h1 >
                        <a href="" className='banner__btn _btn _blue' >Открыть курс</a>
                    </div >
                    <div className="banner__left">
                        <div className="banner__img">
                            <img src={banner} alt="banner img" />
                        </div>
                    </div>
                </div >
            </section >
            <section className="about container">
                <div className="about__title h2"><span>Фенек</span> - это</div>
                <div className="about__items">
                    <div className="about__item item-abput">
                        <div className="item-abput__icon">
                            <AboutIcons name="constructor" />
                        </div>
                        <p className="item-abput__title">Конструктор</p>
                        <p className='item-abput__text'>Создай свой лендинг с помощью конструктора</p>
                    </div>
                    <div className="about__item item-abput">
                        <div className="item-abput__icon">

                        </div>
                        <p className="item-abput__title">Конструктор</p>
                        <p className='item-abput__text'>Создай свой лендинг с помощью конструктора</p>
                    </div>
                    <div className="about__item item-abput">
                        <div className="item-abput__icon">
                            <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M24 34.125H13.5C8.34 34.125 4.875 30.66 4.875 25.5V10.5C4.875 5.34 8.34 1.875 13.5 1.875H24C29.16 1.875 32.625 5.34 32.625 10.5V25.5C32.625 30.66 29.16 34.125 24 34.125ZM13.5 4.125C9.63 4.125 7.125 6.63 7.125 10.5V25.5C7.125 29.37 9.63 31.875 13.5 31.875H24C27.87 31.875 30.375 29.37 30.375 25.5V10.5C30.375 6.63 27.87 4.125 24 4.125H13.5Z" fill="#1E5EFD" />
                                <path d="M31.5 23.625H6C5.385 23.625 4.875 23.115 4.875 22.5C4.875 21.885 5.385 21.375 6 21.375H31.5C32.115 21.375 32.625 21.885 32.625 22.5C32.625 23.115 32.115 23.625 31.5 23.625Z" fill="#1E5EFD" />
                                <path d="M12 19.125H10.5C9.885 19.125 9.375 18.615 9.375 18C9.375 17.385 9.885 16.875 10.5 16.875H12C12.615 16.875 13.125 17.385 13.125 18C13.125 18.615 12.615 19.125 12 19.125Z" fill="#1E5EFD" />
                                <path d="M12 15.375H10.5C9.885 15.375 9.375 14.865 9.375 14.25C9.375 13.635 9.885 13.125 10.5 13.125H12C12.615 13.125 13.125 13.635 13.125 14.25C13.125 14.865 12.615 15.375 12 15.375Z" fill="#1E5EFD" />
                                <path d="M12 11.625H10.5C9.885 11.625 9.375 11.115 9.375 10.5C9.375 9.885 9.885 9.375 10.5 9.375H12C12.615 9.375 13.125 9.885 13.125 10.5C13.125 11.115 12.615 11.625 12 11.625Z" fill="#1E5EFD" />
                                <path d="M25.5 29.2498C25.11 29.2498 24.72 29.0848 24.435 28.8148C24.165 28.5298 24 28.1398 24 27.7498C24 27.3448 24.165 26.9698 24.435 26.6848C24.855 26.2648 25.515 26.1298 26.07 26.3698C26.25 26.4448 26.415 26.5498 26.565 26.6848C26.835 26.9698 27 27.3598 27 27.7498C27 28.1398 26.835 28.5298 26.565 28.8148C26.415 28.9498 26.265 29.0548 26.07 29.1298C25.89 29.2048 25.695 29.2498 25.5 29.2498Z" fill="#1E5EFD" />
                            </svg>
                        </div>
                        <p className="item-abput__title">Конструктор</p>
                        <p className='item-abput__text'>Создай свой лендинг с помощью конструктора</p>
                    </div>
                    <div className="about__item item-abput">
                        <div className="item-abput__icon">
                            <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M24 34.125H13.5C8.34 34.125 4.875 30.66 4.875 25.5V10.5C4.875 5.34 8.34 1.875 13.5 1.875H24C29.16 1.875 32.625 5.34 32.625 10.5V25.5C32.625 30.66 29.16 34.125 24 34.125ZM13.5 4.125C9.63 4.125 7.125 6.63 7.125 10.5V25.5C7.125 29.37 9.63 31.875 13.5 31.875H24C27.87 31.875 30.375 29.37 30.375 25.5V10.5C30.375 6.63 27.87 4.125 24 4.125H13.5Z" fill="#1E5EFD" />
                                <path d="M31.5 23.625H6C5.385 23.625 4.875 23.115 4.875 22.5C4.875 21.885 5.385 21.375 6 21.375H31.5C32.115 21.375 32.625 21.885 32.625 22.5C32.625 23.115 32.115 23.625 31.5 23.625Z" fill="#1E5EFD" />
                                <path d="M12 19.125H10.5C9.885 19.125 9.375 18.615 9.375 18C9.375 17.385 9.885 16.875 10.5 16.875H12C12.615 16.875 13.125 17.385 13.125 18C13.125 18.615 12.615 19.125 12 19.125Z" fill="#1E5EFD" />
                                <path d="M12 15.375H10.5C9.885 15.375 9.375 14.865 9.375 14.25C9.375 13.635 9.885 13.125 10.5 13.125H12C12.615 13.125 13.125 13.635 13.125 14.25C13.125 14.865 12.615 15.375 12 15.375Z" fill="#1E5EFD" />
                                <path d="M12 11.625H10.5C9.885 11.625 9.375 11.115 9.375 10.5C9.375 9.885 9.885 9.375 10.5 9.375H12C12.615 9.375 13.125 9.885 13.125 10.5C13.125 11.115 12.615 11.625 12 11.625Z" fill="#1E5EFD" />
                                <path d="M25.5 29.2498C25.11 29.2498 24.72 29.0848 24.435 28.8148C24.165 28.5298 24 28.1398 24 27.7498C24 27.3448 24.165 26.9698 24.435 26.6848C24.855 26.2648 25.515 26.1298 26.07 26.3698C26.25 26.4448 26.415 26.5498 26.565 26.6848C26.835 26.9698 27 27.3598 27 27.7498C27 28.1398 26.835 28.5298 26.565 28.8148C26.415 28.9498 26.265 29.0548 26.07 29.1298C25.89 29.2048 25.695 29.2498 25.5 29.2498Z" fill="#1E5EFD" />
                            </svg>
                        </div>
                        <p className="item-abput__title">Конструктор</p>
                        <p className='item-abput__text'>Создай свой лендинг с помощью конструктора</p>
                    </div>
                    <div className="about__item item-abput">
                        <div className="item-abput__icon">
                            <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M24 34.125H13.5C8.34 34.125 4.875 30.66 4.875 25.5V10.5C4.875 5.34 8.34 1.875 13.5 1.875H24C29.16 1.875 32.625 5.34 32.625 10.5V25.5C32.625 30.66 29.16 34.125 24 34.125ZM13.5 4.125C9.63 4.125 7.125 6.63 7.125 10.5V25.5C7.125 29.37 9.63 31.875 13.5 31.875H24C27.87 31.875 30.375 29.37 30.375 25.5V10.5C30.375 6.63 27.87 4.125 24 4.125H13.5Z" fill="#1E5EFD" />
                                <path d="M31.5 23.625H6C5.385 23.625 4.875 23.115 4.875 22.5C4.875 21.885 5.385 21.375 6 21.375H31.5C32.115 21.375 32.625 21.885 32.625 22.5C32.625 23.115 32.115 23.625 31.5 23.625Z" fill="#1E5EFD" />
                                <path d="M12 19.125H10.5C9.885 19.125 9.375 18.615 9.375 18C9.375 17.385 9.885 16.875 10.5 16.875H12C12.615 16.875 13.125 17.385 13.125 18C13.125 18.615 12.615 19.125 12 19.125Z" fill="#1E5EFD" />
                                <path d="M12 15.375H10.5C9.885 15.375 9.375 14.865 9.375 14.25C9.375 13.635 9.885 13.125 10.5 13.125H12C12.615 13.125 13.125 13.635 13.125 14.25C13.125 14.865 12.615 15.375 12 15.375Z" fill="#1E5EFD" />
                                <path d="M12 11.625H10.5C9.885 11.625 9.375 11.115 9.375 10.5C9.375 9.885 9.885 9.375 10.5 9.375H12C12.615 9.375 13.125 9.885 13.125 10.5C13.125 11.115 12.615 11.625 12 11.625Z" fill="#1E5EFD" />
                                <path d="M25.5 29.2498C25.11 29.2498 24.72 29.0848 24.435 28.8148C24.165 28.5298 24 28.1398 24 27.7498C24 27.3448 24.165 26.9698 24.435 26.6848C24.855 26.2648 25.515 26.1298 26.07 26.3698C26.25 26.4448 26.415 26.5498 26.565 26.6848C26.835 26.9698 27 27.3598 27 27.7498C27 28.1398 26.835 28.5298 26.565 28.8148C26.415 28.9498 26.265 29.0548 26.07 29.1298C25.89 29.2048 25.695 29.2498 25.5 29.2498Z" fill="#1E5EFD" />
                            </svg>
                        </div>
                        <p className="item-abput__title">Конструктор</p>
                        <p className='item-abput__text'>Создай свой лендинг с помощью конструктора</p>
                    </div>

                </div>
            </section>
        </>

    </>
}
