export const systemItems = [
    {
        title: "Создавай пошаговый план курсов ",
        text: " Проектируй структуру обучения — от вводного модуля до итоговой аттестации. Добавляй видео, тесты, задания."
    },
    {
        title: "Управляй панелью администратора",
        text: "Контролируй курсы, пользователей и настройки платформы из удобного интерфейса."
    },
    {
        title: "Личный кабинет учеников",
        text: "Просматривай персональный прогресс, выполняй задания и отслеживай результаты."
    }
];
