export const systemItems = [
    {
        title: "Видео-курсы1",
        text: "Возможность создавать курсы в виде видео, с возможностью встраивать видео из Youtube, Vimeo, и другими платформами."
    },
    {
        title: "Видео-курсы2",
        text: "Возможность создавать курсы в виде видео, с возможностью встраивать видео из Youtube, Vimeo, и другими платформами."
    },
    {
        title: "Видео-курсы3",
        text: "Возможность создавать курсы в виде видео, с возможностью встраивать видео из Youtube, Vimeo, и другими платформами."
    }
];
